#Introduction

This project aims to build a netflix recommendation system based on the data available on Kaggle.

#Import Libraries

In [3]:
import pandas as pd
import numpy as np
import math
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [10]:
!unzip "/content/gdrive/My Drive/archive.zip"

Archive:  /content/gdrive/My Drive/archive.zip
  inflating: README
  inflating: combined_data_1.txt
  inflating: combined_data_2.txt
  inflating: combined_data_3.txt
  inflating: combined_data_4.txt
  inflating: movie_titles.csv
  inflating: probe.txt
  inflating: qualifying.txt

#Data Preprocessing

##Storing .txt files into dataframes

In [21]:
df1 = pd.read_csv('combined_data_1.txt', header = None, names = ['Customer_Id', 'Rating'], usecols = [0,1])
df1

         Customer_Id  Rating
0                 1:     NaN
1            1488844     3.0
2             822109     5.0
3             885013     4.0
4              30878     4.0
...              ...     ...
24058258     2591364     2.0
24058259     1791000     2.0
24058260      512536     5.0
24058261      988963     3.0
24058262     1704416     3.0

[24058263 rows x 2 columns]

In [22]:
df2 = pd.read_csv('combined_data_2.txt', header = None, names = ['Customer_Id', 'Rating'], usecols = [0,1])
df2

         Customer_Id  Rating
0              4500:     NaN
1            2532865     4.0
2             573364     3.0
3            1696725     3.0
4            1253431     3.0
...              ...     ...
26982297     2420260     1.0
26982298      761176     3.0
26982299      459277     3.0
26982300     2407365     4.0
26982301      627867     3.0

[26982302 rows x 2 columns]

In [23]:
df3 = pd.read_csv('combined_data_3.txt', header = None, names = ['Customer_Id', 'Rating'], usecols = [0,1])
df3

         Customer_Id  Rating
0              9211:     NaN
1            1277134     1.0
2            2435457     2.0
3            2338545     3.0
4            2218269     1.0
...              ...     ...
22605781     2339129     4.0
22605782       59005     4.0
22605783     1789683     5.0
22605784     1878798     1.0
22605785     2634967     1.0

[22605786 rows x 2 columns]

In [15]:
df4 = pd.read_csv('combined_data_4.txt', header = None, names = ['Customer_Id', 'Rating'], usecols = [0,1])
df4

         Customer_Id  Rating
0             13368:     NaN
1            2385003     4.0
2             659432     3.0
3             751812     2.0
4            2625420     2.0
...              ...     ...
26851921     1790158     4.0
26851922     1608708     3.0
26851923      234275     1.0
26851924      255278     4.0
26851925      453585     2.0

[26851926 rows x 2 columns]

In [19]:
totalDF = df1
df2 = df2.drop(labels=0,axis=0)

         Customer_Id  Rating
1            2532865     4.0
2             573364     3.0
3            1696725     3.0
4            1253431     3.0
5            1265574     2.0
...              ...     ...
26982297     2420260     1.0
26982298      761176     3.0
26982299      459277     3.0
26982300     2407365     4.0
26982301      627867     3.0

[26982301 rows x 2 columns]

In [20]:
totalDF = totalDF.append(df2)
totalDF

          Cust_Id  Rating Customer_Id
0              1:     NaN         NaN
1         1488844     3.0         NaN
2          822109     5.0         NaN
3          885013     4.0         NaN
4           30878     4.0         NaN
...           ...     ...         ...
26982297      NaN     1.0     2420260
26982298      NaN     3.0      761176
26982299      NaN     3.0      459277
26982300      NaN     4.0     2407365
26982301      NaN     3.0      627867

[51040564 rows x 3 columns]